_Rarzrabotki/Rarus/USO2/InformationRegisters/ItobПривязкиТерминалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ItobПривязкиТерминалов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТерминалУстановлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Терминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobТерминалы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатУстановленныеАгрегаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатУстановленныеАгрегаты</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СостояниеАгрегата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСостоянияАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМестаУстановкиШин</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелОбъектаЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипАгрегата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатПланированиеРемонтныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатПланированиеРемонтныхРабот</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРемонта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонтов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатРезультатыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатРезультатыСогласования</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованоСЗамечаниями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перенаправлено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатСостоянияАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатСостоянияАгрегатов</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УстановленоВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановленоВЗапас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Снято</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/КонтактныеЛицаПартнеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>КонтактныеЛицаПартнеров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Партнеры</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Партнеры</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрацииСвязи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрекращенияСвязи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПоВизитке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РолиКонтактногоЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РольКонтактногоЛица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиКонтактныхЛицПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/уатОбщегоНазначения_проф/Ext/Module.bsl
// Функция предназначена для определения необходимости отрыть форму обработки "уатТерминалПриемаИВыдачиПутевыхЛистов"
// при старте системы.
//
// Возвращаемое значение:
//   Булево   - признак необходимости открытия обработки "уатТерминалПриемаИВыдачиПутевыхЛистов".
//
Функция НеобходимоОткрытиеТерминалаПЛприСтарте() Экспорт
	
	Если ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.уатТерминалПутевыхЛистов)
			И Не ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.ПолныеПрава)
			И Константы.уатИспользоватьТерминалПриемаВыдачиПутевыхЛистов.Получить() Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // НеобходимоОткрытиеТерминалаПЛприСтарте()

Функция ПолучитьЗначениеКонстанты(Знач ИмяКонстанты) Экспорт
	
	Возврат Константы[ИмяКонстанты].Получить();
	
КонецФункции // ПолучитьЗначениеКонстанты()

/////////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ РАБОТЫ С ОТЧЕТАМИ

// Функция возвращает строку для подстановки в условие запроса и от вида сравнения 
// заполняет структуру параметров.
// Если не задан параметр ПутьКДанным, то надо заменить "#" на имя поля,
//
// Параметры:
//	СтрокаОтбора - ЭлементОтбора - текущая строка отбора
//	Параметры	 - Структура	 - Структура параметров запроса или построителя запроса
//	ПутьКДанным	 - Строка		 - Путь к полю в запросе (ИмяТаблицы.Номенклатура.Код)
//
// Возвращаемое значение:
//	Строка - Строка подстановки в условие запроса
//
Функция СформироватьСтрокуОтбора(СтрокаОтбора, Параметры=Неопределено, ПутьКДанным="#") Экспорт
	
	СтрокаУсловия="";
	Попытка
		ИмяПараметра	= СтрЗаменить(СтрокаОтбора.ПутьКДанным,".", "");
		ВидСравн		= СтрокаОтбора.ВидСравнения;
	Исключение
		Возврат СтрокаУсловия;
	КонецПопытки;
	
	Если ТипЗнч(Параметры)<>Тип("Структура") Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Если ТипЗнч(ПутьКДанным)<>Тип("Строка") Тогда
		ПутьКДанным = "#";
	КонецЕсли;
	
	ТипПараметра = 1;
	Если ВидСравн = ВидСравнения.Равно Тогда
		СтрокаУсловия = ПутьКДанным+" = &"+ИмяПараметра;
	ИначеЕсли ВидСравн= ВидСравнения.НеРавно Тогда
		СтрокаУсловия = ПутьКДанным+" <> &"+ИмяПараметра;
	ИначеЕсли ВидСравн= ВидСравнения.ВСписке Тогда
		СтрокаУсловия = ПутьКДанным+" В (&"+ИмяПараметра+")";
	ИначеЕсли ВидСравн= ВидСравнения.ВСпискеПоИерархии Тогда
		СтрокаУсловия = ПутьКДанным+" В ИЕРАРХИИ (&"+ИмяПараметра+")";
	ИначеЕсли ВидСравн= ВидСравнения.ВИерархии Тогда
		СтрокаУсловия = ПутьКДанным+" В ИЕРАРХИИ (&"+ИмяПараметра+")";	
	ИначеЕсли ВидСравн= ВидСравнения.НеВСписке Тогда
		СтрокаУсловия = "(НЕ "+ПутьКДанным+" В (&"+ИмяПараметра+"))";
	ИначеЕсли ВидСравн= ВидСравнения.НеВСпискеПоИерархии Тогда
		СтрокаУсловия = "(НЕ "+ПутьКДанным+" В ИЕРАРХИИ (&"+ИмяПараметра+"))";
	ИначеЕсли ВидСравн= ВидСравнения.НеВИерархии Тогда
		СтрокаУсловия = "(НЕ "+ПутьКДанным+" В ИЕРАРХИИ (&"+ИмяПараметра+"))";
	ИначеЕсли ВидСравн= ВидСравнения.Больше Тогда
		СтрокаУсловия = ПутьКДанным+">&"+ИмяПараметра;
	ИначеЕсли ВидСравн= ВидСравнения.БольшеИлиРавно Тогда
		СтрокаУсловия = ПутьКДанным+">=&"+ИмяПараметра;
	ИначеЕсли ВидСравн= ВидСравнения.Меньше Тогда
		СтрокаУсловия = ПутьКДанным+"<&"+ИмяПараметра;
	ИначеЕсли ВидСравн= ВидСравнения.МеньшеИлиРавно Тогда
		СтрокаУсловия = ПутьКДанным+"<=&"+ИмяПараметра;
	ИначеЕсли ВидСравн= ВидСравнения.Содержит Тогда
		СтрокаУсловия = ПутьКДанным+" ПОДОБНО &"+ИмяПараметра;
		ТипПараметра  = 2;
	ИначеЕсли ВидСравн= ВидСравнения.НеСодержит Тогда
		СтрокаУсловия = "(НЕ "+ПутьКДанным+" ПОДОБНО &"+ИмяПараметра+")";
		ТипПараметра  = 2;
	ИначеЕсли ВидСравн= ВидСравнения.Интервал Тогда
		СтрокаУсловия = ПутьКДанным+" > &"+ИмяПараметра+"С
		|	И "+ПутьКДанным+" < &"+ИмяПараметра+"По";
		ТипПараметра  = 3;
	ИначеЕсли ВидСравн= ВидСравнения.ИнтервалВключаяГраницы Тогда
		СтрокаУсловия = ПутьКДанным+" >= &"+ИмяПараметра+"С
		|	И "+ПутьКДанным+" <= &"+ИмяПараметра+"По";
		ТипПараметра  = 3;
	ИначеЕсли ВидСравн= ВидСравнения.ИнтервалВключаяНачало Тогда
		СтрокаУсловия = ПутьКДанным+" >= &"+ИмяПараметра+"С
		|	И "+ПутьКДанным+" < &"+ИмяПараметра+"По";
		ТипПараметра  = 3;
	ИначеЕсли ВидСравн= ВидСравнения.ИнтервалВключаяОкончание Тогда
		СтрокаУсловия = ПутьКДанным+" > &"+ИмяПараметра+"С
		|	И "+ПутьКДанным+" <= &"+ИмяПараметра+"По";
		ТипПараметра  = 3;
	КонецЕсли;
	
	Если ТипПараметра=1 Тогда
		Параметры.Вставить(ИмяПараметра, СтрокаОтбора.Значение);
	ИначеЕсли ТипПараметра=2 Тогда
		Параметры.Вставить(ИмяПараметра, "%"+СтрокаОтбора.Значение+"%");
	ИначеЕсли ТипПараметра=3 Тогда
		Параметры.Вставить(ИмяПараметра+"С", СтрокаОтбора.ЗначениеС);
		Параметры.Вставить(ИмяПараметра+"По", СтрокаОтбора.ЗначениеПо);
	КонецЕсли;
	
	Возврат СтрокаУсловия;
	
КонецФункции // отСформироватьСтрокуОтбора()


/////////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ РАБОТЫ С ПУТ. ЛИСТАМИ

// Процедура выполняет проверку корректности заполнения путевого листа
//
// Параметры:
//  УчетнаяПолитика - учетная политика
//  ПутевойЛист  - проверяемый путевой лист
//  Отказ        - отказ
Процедура уатПроверкаКорректностиПЛ(Организация, ПутевойЛист, Отказ) ЭКСПОРТ
	уатОбщегоНазначения.уатПроверкаКорректностиПЛ(Организация, ПутевойЛист, Отказ);
	
	Если ПутевойЛист.ТранспортноеСредство.уатДатаВводаВЭксплуатацию = '00010101'
			Или ПутевойЛист.ТранспортноеСредство.уатДатаВводаВЭксплуатацию > ПутевойЛист.ДатаВыезда Тогда
		ТекстСообщения = "Транспортное средство """ + Строка(ПутевойЛист.ТранспортноеСредство)
			+ """ не введено в эксплуатацию на дату выезда!";
		Сообщить(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
	Если ПутевойЛист.ТранспортноеСредство.уатДатаВыбытия <> '00010101'
			И ПутевойЛист.ТранспортноеСредство.уатДатаВыбытия < ПутевойЛист.ДатаВозвращения Тогда
		ТекстСообщения = "Транспортное средство """ + Строка(ПутевойЛист.ТранспортноеСредство)
			+ """ выведено из эксплуатации до даты возвращения!";
		Сообщить(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
	
	Для Каждого ТекСтрокаПрицеп Из ПутевойЛист.Прицепы Цикл
		Для Каждого ТекСтрока Из ПутевойЛист.Задание Цикл
			Если ТекСтрокаПрицеп.ТС = ТекСтрока.Прицеп1 Или ТекСтрокаПрицеп.ТС = ТекСтрока.Прицеп2 Тогда
				ТекстСообщения = "Прицеп/оборудование """ + Строка(ТекСтрокаПрицеп.ТС)
					+ """ не должно одновременно находиться и в табличной части ""Прицепы"", и в табличной части ""Задание""!";
				Сообщить(ТекстСообщения);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры // утПроверкаКорректностиПЛ       

// Функция возвращает Истина в случае использования ТС какой-либо системы GPS
//
// Параметры:
//  ТС - Ссылка на транспортное средство
Функция уатПроверитьИспользованиеGPS(ТС) ЭКСПОРТ
	
	флИспользование = Ложь;
	
	Если Константы.уатИспользоватьЦСМ.Получить() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ItobПривязкиТерминаловСрезПоследних.Объект
		|ИЗ
		|	РегистрСведений.ItobПривязкиТерминалов.СрезПоследних КАК ItobПривязкиТерминаловСрезПоследних
		|ГДЕ
		|	ItobПривязкиТерминаловСрезПоследних.ТерминалУстановлен
		|	И ItobПривязкиТерминаловСрезПоследних.Объект = &ТС";
		Запрос.УстановитьПараметр("ТС", ТС);                                               
		Результат = Запрос.Выполнить().Выгрузить();
		
		флИспользование = (Результат.Количество() > 0);
	КонецЕсли;
	
	Если Не флИспользование Тогда
		Если Константы.уатИспользоватьDynafleet.Получить()
				Или Константы.уатИспользоватьOmnicomm.Получить()
				Или Константы.уатИспользоватьWialon.Получить()
				Или Константы.уатИспользоватьАвтоГРАФ.Получить()
				Или Константы.уатИспользоватьАвтотрекер.Получить()
				Или Константы.уатИспользоватьСКАУТ.Получить() Тогда
			
			флИспользование = ЗначениеЗаполнено(ТС.уатИДвСистемеНавигации);
		КонецЕсли;
	КонецЕсли;
	
	Возврат флИспользование;
	
КонецФункции


/////////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ РАБОТЫ С БИЗНЕС-ПРОЦЕССАМИ

// Функция возвращает флаг согласования документа
//
Функция ДокументСогласован(ДокументСсылка) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	уатСогласование.Ссылка
	|ИЗ
	|	БизнесПроцесс.уатСогласование КАК уатСогласование
	|ГДЕ
	|	уатСогласование.Предмет = &ДокументСсылка
	|	И уатСогласование.Завершен
	|	И (уатСогласование.РезультатСогласования = ЗНАЧЕНИЕ(Перечисление.уатРезультатыСогласования.Согласовано)
	|			ИЛИ уатСогласование.РезультатСогласования = ЗНАЧЕНИЕ(Перечисление.уатРезультатыСогласования.СогласованоСЗамечаниями))
	|	И НЕ уатСогласование.ПометкаУдаления");
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	РезЗапроса = Запрос.Выполнить();
	
	Возврат (НЕ РезЗапроса.Пустой());
КонецФункции

// Функция возвращает статус согласования документа
//Возвращаемое значение:
//	Структура с ключами
//		- Код - код статуса
//		- Статус - строковое представление статуса
//		- Ссылка - ссылка на бизнес-процесс согласования
//
Функция СтатусСогласования(ДокументСсылка) Экспорт
	Рез = Новый Структура("Код, Статус, Ссылка");
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	уатСогласование.Ссылка,
	|	уатСогласование.Стартован,
	|	уатСогласование.Завершен
	|ИЗ
	|	БизнесПроцесс.уатСогласование КАК уатСогласование
	|ГДЕ
	|	уатСогласование.Предмет = &ДокументСсылка
	|	И НЕ уатСогласование.ПометкаУдаления");
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	РезЗапроса = Запрос.Выполнить();
	
	Если РезЗапроса.Пустой() Тогда
		Рез.Код = 0;
		Рез.Статус = "Не согласован";
	Иначе
		Выборка = РезЗапроса.Выбрать();
		Выборка.Следующий();
		Если НЕ Выборка.Стартован Тогда
			Рез.Код = 1;
			Рез.Статус = "Не согласован";
			Рез.Ссылка = Выборка.Ссылка;
		ИначеЕсли Выборка.Завершен Тогда
			Рез.Код = 3;
			Рез.Статус = "Согласован";
			Рез.Ссылка = Выборка.Ссылка;
		Иначе
			Рез.Код = 2;
			Рез.Статус = "На согласовании";
			Рез.Ссылка = Выборка.Ссылка;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

// Функция создает новый бизнес-процесс
//
Процедура СоздатьБизнесПроцессСогласования(ДокументСсылка,Настройка) Экспорт
	
	СпрСсылка = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументСсылка.Организация,Настройка);
	Если СпрСсылка.Пользователи.Количество() = 0 Тогда
		Сообщить("Для данных документов в обработке ""Установка прав и настроек"" 
			|не выбрана ""Группа исполнителей согласования"".
			|Согласование не было создано!", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
				
	НовыйБП = БизнесПроцессы.уатСогласование.СоздатьБизнесПроцесс();
	НовыйБП.Дата = ТекущаяДата();
	НовыйБП.УстановитьНовыйНомер();
	НовыйБП.Заполнить(ДокументСсылка);
	
	Для Каждого ТекСтрока Из СпрСсылка.Пользователи Цикл
		НоваяСтрока = НовыйБП.Исполнители.Добавить();
		НоваяСтрока.Исполнитель = ТекСтрока.Пользователь;
	КонецЦикла;
	
	Попытка
		НовыйБП.Записать();
		НовыйБП.Старт();
		Сообщить("Для документа было создано согласование """ + НовыйБП.Ссылка + """");
	Исключение
		Сообщить("Для документа не удалось создать согласование!", СтатусСообщения.Внимание);
	КонецПопытки;
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////
// МОНИТОРИНГ

// Функция возвращает признак использования системы ЦСМ.
//
Функция ИспользованиеЦСМ() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат (Константы.уатИспользоватьЦСМ.Получить() = Истина);
КонецФункции

// Процедура выполняет регламентное задание ЗагрузкаДанныхDynafleet.
//
Процедура ЗагрузкаДанныхDynafleet() Экспорт
	
	ИмяСобытияВЖурналеРегистрации = НСтр("en='Download Dynafleet data';ru='Загрузка данных Dynafleet'");
	
	ТекстНСТР = НСтр("en='Start the download session';ru='Начало сеанса загрузки'");
	ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации, УровеньЖурналаРегистрации.Информация,,, ТекстНСТР);
	
	ВсеОК = Истина;
	
	СтруктураДопПараметры = Константы.уатПараметрыРеглЗаданияЗагрузкаДанныхDynafleet.Получить().Получить();
	Если Не ТипЗнч(СтруктураДопПараметры) = Тип("Структура") Тогда
		СтруктураДопПараметры = Новый Структура();
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ЗагрузитьПробегРасход") Тогда
		СтруктураДопПараметры.Вставить("ЗагрузитьПробегРасход", Ложь);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ЗагрузитьКоординаты") Тогда
		СтруктураДопПараметры.Вставить("ЗагрузитьКоординаты", Ложь);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("МассивТС") Тогда
		СтруктураДопПараметры.Вставить("МассивТС", Новый Массив);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ИнтервалЗагрузки") Тогда
		СтруктураДопПараметры.Вставить("ИнтервалЗагрузки", "День");
	КонецЕсли;
	
	Если СтруктураДопПараметры.МассивТС.Количество() = 0 Тогда
		ТекстНСТР = НСтр("en='Not selected any vehicle';ru='Не выбрано ни одно ТС'");
		ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации, УровеньЖурналаРегистрации.Ошибка,,, ТекстНСТР);
		ВызватьИсключение ТекстНСТР;
		ВсеОК = Ложь;
	КонецЕсли;
	
	Если Не СтруктураДопПараметры.ЗагрузитьПробегРасход И Не СтруктураДопПараметры.ЗагрузитьКоординаты Тогда
		ТекстНСТР = НСтр("ru = 'Не указаны параметры: ""Загрузить пробег и расход ГСМ"", ""Загрузить координаты""'");
		ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации, УровеньЖурналаРегистрации.Ошибка,,, ТекстНСТР);
		ВызватьИсключение ТекстНСТР;
		ВсеОК = Ложь;
	КонецЕсли;
	
	// Расчет интервала по параметрам задания.
	Если ВсеОК Тогда
		ДатаПо = ТекущаяДата();
		Если СтруктураДопПараметры.ИнтервалЗагрузки = "Год" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -12);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Полугодие" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -6);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Квартал" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -3);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Месяц" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -1);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Неделя" Тогда
			ДатаС = ДатаПо - 7*24*3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Сутки" Тогда
			ДатаС = ДатаПо - 24*3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "12часов" Тогда
			ДатаС = ДатаПо - 12*3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Час" Тогда
			ДатаС = ДатаПо - 3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Полчаса" Тогда
			ДатаС = ДатаПо - 1800;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "10минут" Тогда
			ДатаС = ДатаПо - 600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Минута" Тогда
			ДатаС = ДатаПо - 60;
		Иначе // Если не указан, считаем что сутки.
			ДатаС = ДатаПо - 24*3600;
		КонецЕсли;
	КонецЕсли;
	
	Если ВсеОК Тогда
		ТекстОшибки = "";
		КодВозврата = 0;
		
		Если СтруктураДопПараметры.ЗагрузитьПробегРасход Тогда // Загружаем пробег и расход ГСМ.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьМестоположениеПоТСDynafleet(ДатаС, ДатаПо, СтруктураДопПараметры.МассивТС, ТекстОшибки);
		КонецЕсли;
		
		Если КодВозврата = 0 И СтруктураДопПараметры.ЗагрузитьКоординаты Тогда // Загружаем координаты.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьКоординатыПоТСDynafleet(ДатаС, ДатаПо, СтруктураДопПараметры.МассивТС, ТекстОшибки);
		КонецЕсли;
		
		Если КодВозврата = 1 Тогда
			ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	
	ТекстНСТР = НСтр("en='The end of the download session';ru='Окончание сеанса загрузки'");
	ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации, УровеньЖурналаРегистрации.Информация,,, ТекстНСТР);
	
КонецПроцедуры

// Процедура выполняет регламентное задание ЗагрузкаДанныхOmnicomm.
//
Процедура ЗагрузкаДанныхOmnicomm() Экспорт
	
	ЗаписьЖурналаРегистрации("Загрузка данных Omnicomm", УровеньЖурналаРегистрации.Информация,,, "Начало сеанса загрузки");
	
	ВсеОК = Истина;
	
	СтруктураДопПараметры = Константы.уатПараметрыРеглЗаданияЗагрузкаДанныхOmnicomm.Получить().Получить();
	Если ТипЗнч(СтруктураДопПараметры) <> Тип("Структура") Тогда
		СтруктураДопПараметры = Новый Структура;
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ЗагрузитьПробегИРасходГСМ") Тогда
		СтруктураДопПараметры.Вставить("ЗагрузитьПробегИРасходГСМ", Ложь);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ЗагрузитьДополнительныеСведения") Тогда
		СтруктураДопПараметры.Вставить("ЗагрузитьДополнительныеСведения", Ложь);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ЗагрузитьКоординаты") Тогда
		СтруктураДопПараметры.Вставить("ЗагрузитьКоординаты", Ложь);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("СписокТС") Тогда
		СтруктураДопПараметры.Вставить("СписокТС", Новый Массив);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ИнтервалЗагрузки") Тогда
		СтруктураДопПараметры.Вставить("ИнтервалЗагрузки", "День");
	КонецЕсли;
	
	Если СтруктураДопПараметры.СписокТС.Количество() = 0 Тогда
		ТекстОшибки = "Не выбрано ни одно ТС";
		ЗаписьЖурналаРегистрации("Загрузка данных Omnicomm", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
		ВсеОК = Ложь;
	КонецЕсли;
	
	Если Не СтруктураДопПараметры.ЗагрузитьПробегИРасходГСМ И Не СтруктураДопПараметры.ЗагрузитьДополнительныеСведения 
			И Не СтруктураДопПараметры.ЗагрузитьКоординаты Тогда
		ТекстОшибки = "Не указаны параметры: ""Загрузить пробег и расход ГСМ"", ""Загрузить доп. сведения""";
		ЗаписьЖурналаРегистрации("Загрузка данных Omnicomm", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
		ВсеОК = Ложь;
	КонецЕсли;
	
	// Расчет интервала по параметрам задания.
	Если ВсеОК Тогда
		ДатаПо = ТекущаяДата();
		Если СтруктураДопПараметры.ИнтервалЗагрузки = "Год" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -12);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Полугодие" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -6);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Квартал" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -3);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Месяц" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -1);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Неделя" Тогда
			ДатаС = ДатаПо - 7*24*3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Сутки" Тогда
			ДатаС = ДатаПо - 24*3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "12часов" Тогда
			ДатаС = ДатаПо - 12*3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Час" Тогда
			ДатаС = ДатаПо - 3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Полчаса" Тогда
			ДатаС = ДатаПо - 1800;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "10минут" Тогда
			ДатаС = ДатаПо - 600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Минута" Тогда
			ДатаС = ДатаПо - 60;
		Иначе // Если не указан, считаем что сутки.
			ДатаС = ДатаПо - 24*3600;
		КонецЕсли;
	КонецЕсли;
	
	Если ВсеОК Тогда
		таблТС = Новый ТаблицаЗначений;
		таблТС.Колонки.Добавить("Ссылка");
		таблТС.Колонки.Добавить("ИДвСистемеНавигации");
		Для Каждого ТекТС Из СтруктураДопПараметры.СписокТС Цикл
			НоваяСтрока = таблТС.Добавить();
			НоваяСтрока.Ссылка = ТекТС;
			НоваяСтрока.ИДвСистемеНавигации = ТекТС.уатИДвСистемеНавигации;
		КонецЦикла;
		
		ТекстОшибки = "";
		
		Если СтруктураДопПараметры.ЗагрузитьДополнительныеСведения Тогда // Загружаем дополнительные сведения.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьДополнительныеСведенияТСOmnicommВРегистр(ДатаС, ДатаПо, таблТС, ТекстОшибки);
		КонецЕсли;
		
		Если КодВозврата = 0 И СтруктураДопПараметры.ЗагрузитьПробегИРасходГСМ Тогда // Загружаем пробег и расход ГСМ.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьМестоположениеТСOmnicommВРегистр(ДатаС, ДатаПо, таблТС, ТекстОшибки);
		КонецЕсли;
		
		Если КодВозврата = 0 И СтруктураДопПараметры.ЗагрузитьКоординаты Тогда // Загружаем координаты.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьКоординатыТСOmnicommВРегистр(ДатаС, ДатаПо, таблТС, ТекстОшибки);
		КонецЕсли;
		
		Если КодВозврата Тогда
			ЗаписьЖурналаРегистрации("Загрузка данных Omnicomm", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Загрузка данных Omnicomm", УровеньЖурналаРегистрации.Информация,,, "Окончание сеанса загрузки");
	
КонецПроцедуры

// Процедура выполняет регламентное задание ЗагрузкаДанныхСКАУТ.
//
Процедура ЗагрузкаДанныхСКАУТ() Экспорт 
	
	ЗаписьЖурналаРегистрации("Загрузка данных СКАУТ", УровеньЖурналаРегистрации.Информация,,, "Начало сеанса загрузки");
	
	ВсеОК = Истина;
	
	СтруктураДопПараметры = Константы.уатПараметрыРеглЗаданияЗагрузкаДанныхСКАУТ.Получить().Получить();
	Если Не ТипЗнч(СтруктураДопПараметры) = Тип("Структура") Тогда
		СтруктураДопПараметры = Новый Структура;
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ЗагрузитьПробегРасход") Тогда
		СтруктураДопПараметры.Вставить("ЗагрузитьПробегРасход", Ложь);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ЗагрузитьДопСведения") Тогда
		СтруктураДопПараметры.Вставить("ЗагрузитьДопСведения", Ложь);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ЗагрузитьКоординаты") Тогда
		СтруктураДопПараметры.Вставить("ЗагрузитьКоординаты", Ложь);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("МассивТС") Тогда
		СтруктураДопПараметры.Вставить("МассивТС", Новый Массив);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ИнтервалЗагрузки") Тогда
		СтруктураДопПараметры.Вставить("ИнтервалЗагрузки", "День");
	КонецЕсли;
	
	Если СтруктураДопПараметры.МассивТС.Количество() = 0 Тогда
		ТекстОшибки = "Не выбрано ни одно ТС";
		ЗаписьЖурналаРегистрации("Загрузка данных СКАУТ", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
		ВсеОК = Ложь;
	КонецЕсли;
	
	Если Не СтруктураДопПараметры.ЗагрузитьПробегРасход И Не СтруктураДопПараметры.ЗагрузитьДопСведения
			И Не СтруктураДопПараметры.ЗагрузитьКоординаты Тогда
		ТекстОшибки = "Не указаны параметры: ""Загрузить пробег и расход ГСМ"", ""Загрузить доп. сведения""";
		ЗаписьЖурналаРегистрации("Загрузка данных СКАУТ", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
		ВсеОК = Ложь;
	КонецЕсли;
	
	// Расчет интервала по параметрам задания.
	Если ВсеОК Тогда
		ДатаПо = ТекущаяДата();
		Если СтруктураДопПараметры.ИнтервалЗагрузки = "Год" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -12);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Полугодие" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -6);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Квартал" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -3);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Месяц" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -1);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Неделя" Тогда
			ДатаС = ДатаПо - 7*24*3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Сутки" Тогда
			ДатаС = ДатаПо - 24*3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "12часов" Тогда
			ДатаС = ДатаПо - 12*3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Час" Тогда
			ДатаС = ДатаПо - 3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Полчаса" Тогда
			ДатаС = ДатаПо - 1800;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "10минут" Тогда
			ДатаС = ДатаПо - 600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Минута" Тогда
			ДатаС = ДатаПо - 60;
		Иначе // Если не указан, считаем что сутки.
			ДатаС = ДатаПо - 24*3600;
		КонецЕсли;
	КонецЕсли;
	
	Если ВсеОК Тогда
		ТекстОшибки = "";
		КодВозврата = 0;
		
		Если СтруктураДопПараметры.ЗагрузитьПробегРасход Тогда // Загружаем пробег и расход ГСМ.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьМестоположениеПоТССКАУТ(ДатаС, ДатаПо, СтруктураДопПараметры.МассивТС, ТекстОшибки);
		КонецЕсли;
		
		Если КодВозврата=0 И СтруктураДопПараметры.ЗагрузитьДопСведения Тогда // Загружаем дополнительные сведения.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьДополнительныеСведенияПоТССКАУТ(ДатаС, ДатаПо, СтруктураДопПараметры.МассивТС, ТекстОшибки);
		КонецЕсли;
		
		Если КодВозврата=0 И СтруктураДопПараметры.ЗагрузитьКоординаты Тогда // Загружаем координаты.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьКоординатыПоТССКАУТ(ДатаС, ДатаПо, СтруктураДопПараметры.МассивТС, ТекстОшибки);
		КонецЕсли;
		
		Если КодВозврата Тогда
			ЗаписьЖурналаРегистрации("Загрузка данных СКАУТ", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Загрузка данных СКАУТ", УровеньЖурналаРегистрации.Информация,,, "Окончание сеанса загрузки");
	
КонецПроцедуры

// Процедура выполняет регламентное задание ЗагрузкаДанныхWialon.
//
Процедура ЗагрузкаДанныхWialon() Экспорт 
	
	ЗаписьЖурналаРегистрации("Загрузка данных Wialon", УровеньЖурналаРегистрации.Информация,,, "Начало сеанса загрузки");
	
	ВсеОК = Истина;
	
	СтруктураДопПараметры = Константы.уатПараметрыРеглЗаданияЗагрузкаДанныхWialon.Получить().Получить();
	Если Не ТипЗнч(СтруктураДопПараметры) = Тип("Структура") Тогда
		СтруктураДопПараметры = Новый Структура;
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ЗагрузитьПробегРасход") Тогда
		СтруктураДопПараметры.Вставить("ЗагрузитьПробегРасход", Ложь);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ЗагрузитьДопСведения") Тогда
		СтруктураДопПараметры.Вставить("ЗагрузитьДопСведения", Ложь);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ЗагрузитьКоординаты") Тогда
		СтруктураДопПараметры.Вставить("ЗагрузитьКоординаты", Ложь);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("МассивТС") Тогда
		СтруктураДопПараметры.Вставить("МассивТС", Новый Массив);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ИнтервалЗагрузки") Тогда
		СтруктураДопПараметры.Вставить("ИнтервалЗагрузки", "День");
	КонецЕсли;
	
	Если СтруктураДопПараметры.МассивТС.Количество() = 0 Тогда
		ТекстОшибки = "Не выбрано ни одно ТС";
		ЗаписьЖурналаРегистрации("Загрузка данных Wialon", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
		ВсеОК = Ложь;
	КонецЕсли;
	
	Если Не СтруктураДопПараметры.ЗагрузитьПробегРасход И Не СтруктураДопПараметры.ЗагрузитьДопСведения
			И Не СтруктураДопПараметры.ЗагрузитьКоординаты Тогда
		ТекстОшибки = "Не указаны параметры: ""Загрузить пробег и расход ГСМ"", ""Загрузить доп. сведения""";
		ЗаписьЖурналаРегистрации("Загрузка данных Wialon", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
		ВсеОК = Ложь;
	КонецЕсли;
	
	// Расчет интервала по параметрам задания.
	Если ВсеОК Тогда
		ДатаПо = ТекущаяДата();
		Если СтруктураДопПараметры.ИнтервалЗагрузки = "Год" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -12);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Полугодие" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -6);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Квартал" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -3);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Месяц" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -1);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Неделя" Тогда
			ДатаС = ДатаПо - 7*24*3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Сутки" Тогда
			ДатаС = ДатаПо - 24*3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "12часов" Тогда
			ДатаС = ДатаПо - 12*3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Час" Тогда
			ДатаС = ДатаПо - 3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Полчаса" Тогда
			ДатаС = ДатаПо - 1800;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "10минут" Тогда
			ДатаС = ДатаПо - 600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Минута" Тогда
			ДатаС = ДатаПо - 60;
		Иначе // Если не указан, считаем что сутки.
			ДатаС = ДатаПо - 24*3600;
		КонецЕсли;
	КонецЕсли;
	
	Если ВсеОК Тогда
		ТекстОшибки = "";
		КодВозврата = 0;
		
		Если СтруктураДопПараметры.ЗагрузитьПробегРасход Тогда // Загружаем пробег и расход ГСМ.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьМестоположениеПоТСWialon(ДатаС, ДатаПо, СтруктураДопПараметры.МассивТС, ТекстОшибки, Истина);
		КонецЕсли;
		
		Если КодВозврата = 0 И СтруктураДопПараметры.ЗагрузитьДопСведения Тогда // Загружаем дополнительные сведения.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьДополнительныеСведенияПоТСWialon(ДатаС, ДатаПо, СтруктураДопПараметры.МассивТС, ТекстОшибки, Истина);
		КонецЕсли;
		
		Если КодВозврата = 0 И СтруктураДопПараметры.ЗагрузитьКоординаты Тогда // Загружаем координаты.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьКоординатыПоТСWialon(ДатаС, ДатаПо, СтруктураДопПараметры.МассивТС, ТекстОшибки, Истина);
		КонецЕсли;
		
		Если КодВозврата = 1 Тогда
			ЗаписьЖурналаРегистрации("Загрузка данных Wialon", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Загрузка данных Wialon", УровеньЖурналаРегистрации.Информация,,, "Окончание сеанса загрузки");
	
КонецПроцедуры

// Процедура выполняет регламентное задание ЗагрузкаДанныхАвтоГРАФ.
//
Процедура ЗагрузкаДанныхАвтоГРАФ() Экспорт 
	
	ЗаписьЖурналаРегистрации("Загрузка данных АвтоГРАФ", УровеньЖурналаРегистрации.Информация,,, "Начало сеанса загрузки");
	
	ВсеОК = Истина;
	
	СтруктураДопПараметры = Константы.уатПараметрыРеглЗаданияЗагрузкаДанныхАвтоГРАФ.Получить().Получить();
	Если Не ТипЗнч(СтруктураДопПараметры) = Тип("Структура") Тогда
		СтруктураДопПараметры = Новый Структура;
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ЗагрузитьПробегРасход") Тогда
		СтруктураДопПараметры.Вставить("ЗагрузитьПробегРасход", Ложь);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ЗагрузитьДопСведения") Тогда
		СтруктураДопПараметры.Вставить("ЗагрузитьДопСведения", Ложь);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ЗагрузитьКоординаты") Тогда
		СтруктураДопПараметры.Вставить("ЗагрузитьКоординаты", Ложь);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("МассивТС") Тогда
		СтруктураДопПараметры.Вставить("МассивТС", Новый Массив);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ИнтервалЗагрузки") Тогда
		СтруктураДопПараметры.Вставить("ИнтервалЗагрузки", "День");
	КонецЕсли;
	
	Если СтруктураДопПараметры.МассивТС.Количество() = 0 Тогда
		ТекстОшибки = "Не выбрано ни одно ТС";
		ЗаписьЖурналаРегистрации("Загрузка данных АвтоГРАФ", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
		ВсеОК = Ложь;
	КонецЕсли;
	
	Если Не СтруктураДопПараметры.ЗагрузитьПробегРасход И Не СтруктураДопПараметры.ЗагрузитьДопСведения
			И Не СтруктураДопПараметры.ЗагрузитьКоординаты Тогда
		ТекстОшибки = "Не указаны параметры: ""Загрузить пробег и расход ГСМ"", ""Загрузить доп. сведения""";
		ЗаписьЖурналаРегистрации("Загрузка данных АвтоГРАФ", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
		ВсеОК = Ложь;
	КонецЕсли;
	
	// Расчет интервала по параметрам задания.
	Если ВсеОК Тогда
		ДатаПо = ТекущаяДата();
		Если СтруктураДопПараметры.ИнтервалЗагрузки = "Год" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -12);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Полугодие" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -6);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Квартал" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -3);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Месяц" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -1);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Неделя" Тогда
			ДатаС = ДатаПо - 7*24*3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Сутки" Тогда
			ДатаС = ДатаПо - 24*3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "12часов" Тогда
			ДатаС = ДатаПо - 12*3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Час" Тогда
			ДатаС = ДатаПо - 3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Полчаса" Тогда
			ДатаС = ДатаПо - 1800;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "10минут" Тогда
			ДатаС = ДатаПо - 600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Минута" Тогда
			ДатаС = ДатаПо - 60;
		Иначе // Если не указан, считаем что сутки.
			ДатаС = ДатаПо - 24*3600;
		КонецЕсли;
	КонецЕсли;
	
	Если ВсеОК Тогда
		ТекстОшибки = "";
		КодВозврата = 0;
		
		Если СтруктураДопПараметры.ЗагрузитьПробегРасход Тогда // Загружаем пробег и расход ГСМ.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьМестоположениеПоТСАвтоГРАФ(ДатаС, ДатаПо, СтруктураДопПараметры.МассивТС, ТекстОшибки);
		КонецЕсли;
		
		Если КодВозврата=0 И СтруктураДопПараметры.ЗагрузитьДопСведения Тогда // Загружаем дополнительные сведения.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьДополнительныеСведенияПоТСАвтоГРАФ(ДатаС, ДатаПо, СтруктураДопПараметры.МассивТС, ТекстОшибки);
		КонецЕсли;
		
		Если КодВозврата=0 И СтруктураДопПараметры.ЗагрузитьКоординаты Тогда // Загружаем координаты.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьКоординатыПоТСАвтоГРАФ(ДатаС, ДатаПо, СтруктураДопПараметры.МассивТС, ТекстОшибки);
		КонецЕсли;
		
		Если КодВозврата Тогда
			ЗаписьЖурналаРегистрации("Загрузка данных АвтоГРАФ", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Загрузка данных АвтоГРАФ", УровеньЖурналаРегистрации.Информация,,, "Окончание сеанса загрузки");
	
КонецПроцедуры

// Процедура выполняет регламентное задание ЗагрузкаДанныхАвтотрекер.
//
Процедура ЗагрузкаДанныхАвтотрекер() Экспорт
	
	ЗаписьЖурналаРегистрации("Загрузка данных Автотрекер", УровеньЖурналаРегистрации.Информация,,, "Начало сеанса загрузки");
	
	ВсеОК = Истина;
	
	СтруктураДопПараметры = Константы.уатПараметрыРеглЗаданияЗагрузкаДанныхАвтотрекер.Получить().Получить();
	Если Не ТипЗнч(СтруктураДопПараметры) = Тип("Структура") Тогда
		СтруктураДопПараметры = Новый Структура;
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ЗагрузитьПробегРасход") Тогда
		СтруктураДопПараметры.Вставить("ЗагрузитьПробегРасход", Ложь);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ЗагрузитьДопСведения") Тогда
		СтруктураДопПараметры.Вставить("ЗагрузитьДопСведения", Ложь);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ЗагрузитьКоординаты") Тогда
		СтруктураДопПараметры.Вставить("ЗагрузитьКоординаты", Ложь);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("МассивТС") Тогда
		СтруктураДопПараметры.Вставить("МассивТС", Новый Массив);
	КонецЕсли;
	Если Не СтруктураДопПараметры.Свойство("ИнтервалЗагрузки") Тогда
		СтруктураДопПараметры.Вставить("ИнтервалЗагрузки", "День");
	КонецЕсли;
	
	Если СтруктураДопПараметры.МассивТС.Количество() = 0 Тогда
		ТекстОшибки = "Не выбрано ни одно ТС";
		ЗаписьЖурналаРегистрации("Загрузка данных Автотрекер", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
		ВсеОК = Ложь;
	КонецЕсли;
	
	Если Не СтруктураДопПараметры.ЗагрузитьПробегРасход И Не СтруктураДопПараметры.ЗагрузитьДопСведения
			И Не СтруктураДопПараметры.ЗагрузитьКоординаты Тогда
		ТекстОшибки = "Не указаны параметры: ""Загрузить пробег и расход ГСМ"", ""Загрузить доп. сведения""";
		ЗаписьЖурналаРегистрации("Загрузка данных Автотрекер", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
		ВсеОК = Ложь;
	КонецЕсли;
	
	// Расчет интервала по параметрам задания.
	Если ВсеОК Тогда
		ДатаПо = ТекущаяДата();
		Если СтруктураДопПараметры.ИнтервалЗагрузки = "Год" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -12);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Полугодие" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -6);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Квартал" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -3);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Месяц" Тогда
			ДатаС = ДобавитьМесяц(ДатаПо, -1);
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Неделя" Тогда
			ДатаС = ДатаПо - 7*24*3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Сутки" Тогда
			ДатаС = ДатаПо - 24*3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "12часов" Тогда
			ДатаС = ДатаПо - 12*3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Час" Тогда
			ДатаС = ДатаПо - 3600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Полчаса" Тогда
			ДатаС = ДатаПо - 1800;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "10минут" Тогда
			ДатаС = ДатаПо - 600;
		ИначеЕсли СтруктураДопПараметры.ИнтервалЗагрузки = "Минута" Тогда
			ДатаС = ДатаПо - 60;
		Иначе // Если не указан, считаем что сутки.
			ДатаС = ДатаПо - 24*3600;
		КонецЕсли;
	КонецЕсли;
	
	Если ВсеОК Тогда
		ТекстОшибки = "";
		КодВозврата = 0;
		
		Если СтруктураДопПараметры.ЗагрузитьПробегРасход Тогда // Загружаем пробег и расход ГСМ.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьМестоположениеПоТСАвтотрекер(ДатаС, ДатаПо, СтруктураДопПараметры.МассивТС, ТекстОшибки);
		КонецЕсли;
		
		Если КодВозврата=0 И СтруктураДопПараметры.ЗагрузитьДопСведения Тогда // Загружаем дополнительные сведения.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьДополнительныеСведенияПоТСАвтотрекер(ДатаС, ДатаПо, СтруктураДопПараметры.МассивТС, ТекстОшибки);
		КонецЕсли;
		
		Если КодВозврата=0 И СтруктураДопПараметры.ЗагрузитьКоординаты Тогда // Загружаем координаты.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьКоординатыПоТСАвтотрекер(ДатаС, ДатаПо, СтруктураДопПараметры.МассивТС, ТекстОшибки);
		КонецЕсли;
		
		Если КодВозврата Тогда
			ЗаписьЖурналаРегистрации("Загрузка данных Автотрекер", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Загрузка данных Автотрекер", УровеньЖурналаРегистрации.Информация,,, "Окончание сеанса загрузки");
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////
// РЕМОНТЫ

Процедура уатОбновлениеПланаРемонтныхРабот() Экспорт
	
	ЗаписьЖурналаРегистрации("Обновление плана ремонтных работ", УровеньЖурналаРегистрации.Информация,,, "Начало процедуры обновления данных");
	
	ОбновитьПланыРемонтныхРабот();
	
	ЗаписьЖурналаРегистрации("Обновление плана ремонтных работ", УровеньЖурналаРегистрации.Информация,,, "Обновление данных завершено");
	
КонецПроцедуры

Процедура ОбновитьПланыРемонтныхРабот() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Метаданные.Обработки.Найти("ПланированиеРемонтныхРабот") = Неопределено Тогда 
		ЗаписьЖурналаРегистрации("Обновление плана ремонтных работ", УровеньЖурналаРегистрации.Ошибка,,, "Отсутствует обработка ""ПланированиеРемонтныхРабот"".");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТранспортныеСредства.Ссылка КАК ТС,
	|	ТранспортныеСредства.уатОбъектЭксплуатации КАК ОбъектЭксплуатации
	|ИЗ
	|	Справочник.ТранспортныеСредства КАК ТранспортныеСредства
	|ГДЕ
	|	НЕ ТранспортныеСредства.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатУстановленныеАгрегатыСрезПоследних.ТранспортноеСредство,
	|	уатУстановленныеАгрегатыСрезПоследних.УзелОбъектаЭксплуатации
	|ИЗ
	|	РегистрСведений.уатУстановленныеАгрегаты.СрезПоследних(
	|			,
	|			СостояниеАгрегата = ЗНАЧЕНИЕ(Перечисление.уатСостоянияАгрегатов.УстановленоВРаботе)
	|								ИЛИ СостояниеАгрегата = ЗНАЧЕНИЕ(Перечисление.уатСостоянияАгрегатов.УстановленоВЗапас)) КАК уатУстановленныеАгрегатыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбщиеВидыРемонтов.Ссылка КАК ОбщийВидРемонта
	|ИЗ
	|	Справочник.ОбщиеВидыРемонтов КАК ОбщиеВидыРемонтов
	|ГДЕ
	|	НЕ ОбщиеВидыРемонтов.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧастотаПланированияРемонтов.Ссылка КАК ЧастотаПланирования
	|ИЗ
	|	Перечисление.ЧастотаПланированияРемонтов КАК ЧастотаПланированияРемонтов";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ОбработкаПланирования = Обработки["ПланированиеРемонтныхРабот"].Создать();
	
	ВыборкаТС = РезультатЗапроса[0].Выбрать();
	
	СоответствиеТСобъектам = Новый Соответствие();
	
	Пока ВыборкаТС.Следующий() Цикл 
		НоваяСтрока = ОбработкаПланирования.ОбъектыРемонтаКПланированию.Добавить();
		НоваяСтрока.ОбъектЭксплуатации = ВыборкаТС.ОбъектЭксплуатации;
		
		СоответствиеТСобъектам.Вставить(ВыборкаТС.ОбъектЭксплуатации, ВыборкаТС.ТС);
	КонецЦикла;
	
	ОбработкаПланирования.ОбщиеВидыРемонтовКПланированию.Загрузить(РезультатЗапроса[1].Выгрузить());
	ОбработкаПланирования.ЧастотыКПланированию.Загрузить(РезультатЗапроса[2].Выгрузить());
	
	ОбработкаПланирования.РассчитатьПланРемонтныхРабот();
	
	// Очистка регистра перед добавлением актуальных записей.
	НаборЗаписей = РегистрыСведений.уатПланированиеРемонтныхРабот.СоздатьНаборЗаписей();
	НаборЗаписей.Записать(Истина);
	
	Для Каждого ТекСтрокаПлана Из ОбработкаПланирования.Ремонты Цикл 
		ТекТС = СоответствиеТСобъектам.Получить(ТекСтрокаПлана.ОбъектЭксплуатации);
		Если ТекТС = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.уатПланированиеРемонтныхРабот.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТС.Установить(ТекТС);
		НаборЗаписей.Отбор.ВидРемонта.Установить(ТекСтрокаПлана.ВидРемонта);
		
		Запись = НаборЗаписей.Добавить();
		Запись.ТС          = ТекТС;
		Запись.ВидРемонта  = ТекСтрокаПлана.ВидРемонта;
		Запись.ДатаРемонта = ТекСтрокаПлана.ДатаНачала;
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	Константы.уатДатаАктуальностиПланаРемонтныхРабот.Установить(ТекущаяДата());
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////
// ПОДКЛЮЧАЕМОЕ ОБОРУДОВАНИЕ

// Настраивает подключаемое оборудование в форме,
// устанавливает флаг ИспользоватьПодключаемоеОборудование в форме
// Параметры:
//   Форма - Форма, в которой необходимо настроить подключаемое оборудование
//
Процедура НастроитьПодключаемоеОборудование(Форма) Экспорт
	
	ТипыПодключенногоОборудования = уатОбщегоНазначенияПовтИсп_проф.ТипыПодключенногоОборудования();
	
	Форма.ИспользоватьПодключаемоеОборудование = ИспользоватьПодключаемоеОборудование(ТипыПодключенногоОборудования);
	
	//ЕстьТСД  =
	//	ТипыПодключенногоОборудования <> Неопределено
	//	И ТипыПодключенногоОборудования.Найти(Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных) <> Неопределено;
	//ЕстьВесы =
	//	ТипыПодключенногоОборудования <> Неопределено
	//	И ТипыПодключенногоОборудования.Найти(Перечисления.ТипыПодключаемогоОборудования.ЭлектронныеВесы) <> Неопределено;
	//
	//ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
	//	Форма.Элементы,
	//	"ТоварыЗагрузитьДанныеИзТСД",
	//	"Видимость",
	//	Форма.ИспользоватьПодключаемоеОборудование И ЕстьТСД);
	//
	//ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
	//	Форма.Элементы,
	//	"ВыгрузитьДанныеВТСД",
	//	"Видимость",
	//	Форма.ИспользоватьПодключаемоеОборудование И ЕстьТСД);
	//
	//ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
	//	Форма.Элементы,
	//	"ТоварыПолучитьВес",
	//	"Видимость",
	//	Форма.ИспользоватьПодключаемоеОборудование И ЕстьВесы);
	
КонецПроцедуры

// Проверяет, что включена ф.о "Использовать подключаемое оборудование",
// настроено ли оборудование и авторизовался пользователь,
// а не внешний пользователь.
Функция ИспользоватьПодключаемоеОборудование(ТипыПодключенногоОборудования = Неопределено) Экспорт
	
	ИспользоватьПодключаемоеОборудование = ПолучитьФункциональнуюОпцию("ИспользоватьПодключаемоеОборудование");
	ПользовательАвторизовался 			 = ТипЗнч(Пользователи.АвторизованныйПользователь()) = Тип("СправочникСсылка.Пользователи");
	
	Если ТипыПодключенногоОборудования = Неопределено Тогда
		ТипыПодключенногоОборудования = уатОбщегоНазначенияПовтИсп_проф.ТипыПодключенногоОборудования();
	КонецЕсли;
	
	Если ИспользоватьПодключаемоеОборудование Тогда
		Если НЕ РольДоступна("ПолныеПрава") И НЕ РольДоступна("ИспользованиеПодключаемогоОборудования") Тогда
			Сообщить("Для использования подключаемого оборудования необходимо включить роль ""Использование подключаемого оборудования""!");
			ИспользоватьПодключаемоеОборудование = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат
		ИспользоватьПодключаемоеОборудование
		И ПользовательАвторизовался
		И ТипыПодключенногоОборудования <> Неопределено
		И ТипыПодключенногоОборудования.Количество() > 0;
												 
КонецФункции


/////////////////////////////////////////////////////////////////////////////////////
// ПЕЧАТЬ

// Формирует структуру, содержащую значения реквизитов шапки документа.
//
// Параметры: 
//  ДокументОбъект - объект документа для формирования структуры шапки, 
//
// Возвращаемое значение:
//  Сформированная структура.
//
Функция СформироватьСтруктуруШапкиДокумента(ДокСсылка) Экспорт
	
	СтруктураШапкиДокумента = Новый Структура;
	СтруктураШапкиДокумента.Вставить("Ссылка", ДокСсылка);
	СтруктураШапкиДокумента.Вставить("Дата", ДокСсылка.Дата);
	Для каждого Реквизит Из ДокСсылка.Метаданные().Реквизиты Цикл
		СтруктураШапкиДокумента.Вставить(Реквизит.Имя, ДокСсылка[Реквизит.Имя]);
	КонецЦикла;
	
	Возврат СтруктураШапкиДокумента;
	
КонецФункции // СформироватьСтруктуруШапкиДокумента()

// Функция возвращает струткуру с наименованием и должностью контактного лица контрагента
Функция ПолучитьДолжностьИНаименованиеКонтрагента(Знач мКонтрагент) Экспорт 
	
	Результат = Новый Структура("Наименование, Должность", "", "");
	
	мЗапрос = Новый Запрос;
	
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактныеЛицаПартнеров.Наименование,
	|	КонтактныеЛицаПартнеров.ДолжностьПоВизитке
	|ПОМЕСТИТЬ ВРТ_КонтрактныеЛица
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|ГДЕ
	|	КонтактныеЛицаПартнеров.Владелец = &Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВРТ_КонтрактныеЛица.Наименование,
	|	ВРТ_КонтрактныеЛица.ДолжностьПоВизитке,
	|	1 КАК Порядок
	|ИЗ
	|	ВРТ_КонтрактныеЛица КАК ВРТ_КонтрактныеЛица
	|ГДЕ
	|	ВРТ_КонтрактныеЛица.ДолжностьПоВизитке ПОДОБНО ""_иректор""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВРТ_КонтрактныеЛица.Наименование,
	|	ВРТ_КонтрактныеЛица.ДолжностьПоВизитке,
	|	2
	|ИЗ
	|	ВРТ_КонтрактныеЛица КАК ВРТ_КонтрактныеЛица
	|ГДЕ
	|	ВРТ_КонтрактныеЛица.ДолжностьПоВизитке ПОДОБНО ""_л% бухгалтер""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВРТ_КонтрактныеЛица.Наименование,
	|	ВРТ_КонтрактныеЛица.ДолжностьПоВизитке,
	|	3
	|ИЗ
	|	ВРТ_КонтрактныеЛица КАК ВРТ_КонтрактныеЛица
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	мЗапрос.УстановитьПараметр("Владелец", мКонтрагент.Партнер);
	мВыборка = мЗапрос.Выполнить().Выбрать();
	
	Если мВыборка.Следующий() Тогда
		Результат.Наименование = мВыборка.Наименование;
		Результат.Должность    = мВыборка.ДолжностьПоВизитке;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьДанныеКонтрагентаДляЭСМ7()
